/*
 * ad7606.c
 *
 *  Created on: 2023年2月18日
 *      Author: NJY_r
 */

#include "ad7606.h"


AD7606_VAR_T g_tAD7606;		/* 定义1个全局变量，保存一些参数 */

/* AD7606 FSMC总线地址，只能读，无需写 */
#define AD7606_RESULT()	*(__IO uint16_t *)0x6C000000

/*
 * ****************************************************************************** *
 * 函 数 名: AD7606_RESET
 * 功能说明: AD7606复位程序
 * 形    参: 无
 * 返 回 值: 无
 * ****************************************************************************** *
 */
void AD7606_RESET()
{
	AD7606Rst_L;
	/* RESET复位高电平脉冲宽度最小50ns。 */
	AD7606Rst_H;
	// 主频168M  即1/168M = 0.00595us = 5.95ns
	for (int i =10; i>0; i--)
	{
		__NOP();
	}

	AD7606Rst_L;
}


/*
 * ****************************************************************************** *
 * 函 数 名: AD7606_SetOS
 * 功能说明: 配置AD7606数字滤波器，也就设置过采样倍率。
 * 			通过设置 AD7606_OS0、OS1、OS2口线的电平组合状态决定过采样倍率。
 * 			启动AD转换之后，AD7606内部自动实现剩余样本的采集，然后求平均值输出。
 *
 *			过采样倍率越高，转换时间越长。
 *			  0、无过采样时，AD转换时间 = 3.45us - 4.15us
 *			  1、2倍过采样时 = 7.87us - 9.1us
 *			  2、4倍过采样时 = 16.05us - 18.8us
 *			  3、8倍过采样时 = 33us - 39us
 *			  4、16倍过采样时 = 66us - 78us
 *			  5、32倍过采样时 = 133us - 158us
 *			  6、64倍过采样时 = 257us - 315us*
 *	形    参: _ucOS : 过采样倍率, 0 - 6
 *	返 回 值: 无
 * ****************************************************************************** *
 */
void AD7606_SetOS(uint8_t _usOS)
{
	g_tAD7606.ucOS = _usOS;
	switch (_usOS)
	{
		case AD_OS_X2:
			AD7606_Os0_0;
			AD7606_Os1_0;
			AD7606_Os2_1;
			break;
		case AD_OS_X4:
			AD7606_Os0_0;
			AD7606_Os1_1;
			AD7606_Os2_0;
			break;
		case AD_OS_X8:
			AD7606_Os0_0;
			AD7606_Os1_1;
			AD7606_Os2_1;
			break;
		case AD_OS_X16:
			AD7606_Os0_1;
			AD7606_Os1_0;
			AD7606_Os2_0;
			break;
		case AD_OS_X32:
			AD7606_Os0_1;
			AD7606_Os1_0;
			AD7606_Os2_1;
			break;
		case AD_OS_X64:
			AD7606_Os0_1;
			AD7606_Os1_1;
			AD7606_Os2_0;
			break;
		case AD_OS_NO:
		default:
			g_tAD7606.ucOS = AD_OS_NO;
			AD7606_Os0_0;
			AD7606_Os1_0;
			AD7606_Os2_0;
			break;
	}

}
